{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "coding",
    "1": "cooking",
    "2": "creative",
    "3": "embedding",
    "4": "general",
    "5": "math_reasoning",
    "6": "qa",
    "7": "research",
    "8": "summarization",
    "9": "tools",
    "10": "translation",
    "11": "vision"
  },
  "initializer_range": 0.02,
  "label2id": {
    "coding": 0,
    "cooking": 1,
    "creative": 2,
    "embedding": 3,
    "general": 4,
    "math_reasoning": 5,
    "qa": 6,
    "research": 7,
    "summarization": 8,
    "tools": 9,
    "translation": 10,
    "vision": 11
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 30522,
  "task_labels": [
    "coding",
    "cooking",
    "creative",
    "embedding",
    "general",
    "math_reasoning",
    "qa",
    "research",
    "summarization",
    "tools",
    "translation",
    "vision"
  ]
}